In [10]:
import pandas as pd

In [14]:
df = pd.read_csv(r"C:\Users\jki\Desktop\Preactse Data sets\salaries.csv")

In [15]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Business Intelligence Engineer,202800,USD,202800,US,0,US,L
1,2023,SE,FT,Business Intelligence Engineer,104300,USD,104300,US,0,US,L
2,2023,MI,FT,Data Manager,60000,GBP,73824,GB,0,GB,M
3,2023,MI,FT,Data Manager,55000,GBP,67672,GB,0,GB,M
4,2023,SE,FT,Data Scientist,290000,USD,290000,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
7969,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
7970,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
7971,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
7972,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
7973,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [16]:
# display the last 10 rows of the dataset
df.head(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Business Intelligence Engineer,202800,USD,202800,US,0,US,L
1,2023,SE,FT,Business Intelligence Engineer,104300,USD,104300,US,0,US,L
2,2023,MI,FT,Data Manager,60000,GBP,73824,GB,0,GB,M
3,2023,MI,FT,Data Manager,55000,GBP,67672,GB,0,GB,M
4,2023,SE,FT,Data Scientist,290000,USD,290000,US,0,US,M
5,2023,SE,FT,Data Scientist,173200,USD,173200,US,0,US,M
6,2023,SE,FT,Data Scientist,235000,USD,235000,US,100,US,M
7,2023,SE,FT,Data Scientist,204000,USD,204000,US,100,US,M
8,2023,SE,FT,Machine Learning Scientist,300000,USD,300000,US,0,US,M
9,2023,SE,FT,Machine Learning Scientist,222000,USD,222000,US,0,US,M